In [1]:
person = {
    "first": "Brian",
    "last": "Huynh",
    "email": "huynh2102@gmail.com"
}

In [2]:
people = {
    "first": "Brian",
    "last": "Huynh",
    "email": "huynh2102@gmail.com"
}

In [3]:
people = {
    "first": ["Brian", "Corey", "John"],
    "last": ["Huynh", "Schafer", "Doe"],
    "email": ["huynh2102@gmail.com", "coreymschafer@gmail.com", 'johndoe@gmail.com']
}

In [4]:
people['email']

['huynh2102@gmail.com', 'coreymschafer@gmail.com', 'johndoe@gmail.com']

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(people)

In [7]:
df

   first     last                    email
0  Brian    Huynh      huynh2102@gmail.com
1  Corey  Schafer  coreymschafer@gmail.com
2   John      Doe        johndoe@gmail.com

In [8]:
df['email']

0        huynh2102@gmail.com
1    coreymschafer@gmail.com
2          johndoe@gmail.com
Name: email, dtype: object

In [9]:
type(df['email'])

pandas.core.series.Series

In [10]:
df.count

<bound method DataFrame.count of    first     last                    email
0  Brian    Huynh      huynh2102@gmail.com
1  Corey  Schafer  coreymschafer@gmail.com
2   John      Doe        johndoe@gmail.com>

In [11]:
df[['last', 'email']]

      last                    email
0    Huynh      huynh2102@gmail.com
1  Schafer  coreymschafer@gmail.com
2      Doe        johndoe@gmail.com

In [12]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [13]:
df.iloc[[0, 1]]

   first     last                    email
0  Brian    Huynh      huynh2102@gmail.com
1  Corey  Schafer  coreymschafer@gmail.com

In [14]:
df.iloc[0]

first                  Brian
last                   Huynh
email    huynh2102@gmail.com
Name: 0, dtype: object

In [15]:
df.iloc[[0, 1], 2]

0        huynh2102@gmail.com
1    coreymschafer@gmail.com
Name: email, dtype: object

In [16]:
df

   first     last                    email
0  Brian    Huynh      huynh2102@gmail.com
1  Corey  Schafer  coreymschafer@gmail.com
2   John      Doe        johndoe@gmail.com

In [17]:
df.loc[0]

first                  Brian
last                   Huynh
email    huynh2102@gmail.com
Name: 0, dtype: object

In [18]:
df.loc[[0, 1]]

   first     last                    email
0  Brian    Huynh      huynh2102@gmail.com
1  Corey  Schafer  coreymschafer@gmail.com

In [19]:
df.loc[[0, 1], ["last", "email"]]

      last                    email
0    Huynh      huynh2102@gmail.com
1  Schafer  coreymschafer@gmail.com

In [20]:
df

   first     last                    email
0  Brian    Huynh      huynh2102@gmail.com
1  Corey  Schafer  coreymschafer@gmail.com
2   John      Doe        johndoe@gmail.com

In [21]:
df['email']

0        huynh2102@gmail.com
1    coreymschafer@gmail.com
2          johndoe@gmail.com
Name: email, dtype: object

In [22]:
df.set_index('email')

                         first     last
email
huynh2102@gmail.com      Brian    Huynh
coreymschafer@gmail.com  Corey  Schafer
johndoe@gmail.com         John      Doe

In [23]:
df.set_index('email', inplace=True)

In [24]:
df

                         first     last
email
huynh2102@gmail.com      Brian    Huynh
coreymschafer@gmail.com  Corey  Schafer
johndoe@gmail.com         John      Doe

In [25]:
df.index

Index(['huynh2102@gmail.com', 'coreymschafer@gmail.com', 'johndoe@gmail.com'], dtype='object', name='email')

In [26]:
df.loc['huynh2102@gmail.com', 'last']

'Huynh'

In [27]:
df.iloc[0]

first    Brian
last     Huynh
Name: huynh2102@gmail.com, dtype: object

In [28]:
df.reset_index(inplace = True)

In [29]:
df

                     email  first     last
0      huynh2102@gmail.com  Brian    Huynh
1  coreymschafer@gmail.com  Corey  Schafer
2        johndoe@gmail.com   John      Doe

In [30]:
df['last'] == 'Doe'

0    False
1    False
2     True
Name: last, dtype: bool

In [31]:
filt = (df['last'] == 'Doe') & (df['first'] == 'John')

In [32]:
df[filt]

               email first last
2  johndoe@gmail.com  John  Doe

In [33]:
df.loc[filt,'first']
df

                     email  first     last
0      huynh2102@gmail.com  Brian    Huynh
1  coreymschafer@gmail.com  Corey  Schafer
2        johndoe@gmail.com   John      Doe

In [34]:
df.columns = ('email','first_name', 'last_name')
df

                     email first_name last_name
0      huynh2102@gmail.com      Brian     Huynh
1  coreymschafer@gmail.com      Corey   Schafer
2        johndoe@gmail.com       John       Doe

In [35]:
#Change name of column into UPPER CASE
df.columns = [x.upper() for x in df.columns]
df

                     EMAIL FIRST_NAME LAST_NAME
0      huynh2102@gmail.com      Brian     Huynh
1  coreymschafer@gmail.com      Corey   Schafer
2        johndoe@gmail.com       John       Doe

In [36]:
# Change name of columns into lowercase
df.columns = [x.lower() for x in df.columns]
df

                     email first_name last_name
0      huynh2102@gmail.com      Brian     Huynh
1  coreymschafer@gmail.com      Corey   Schafer
2        johndoe@gmail.com       John       Doe

In [37]:
#change a specific name of a column
df.columns = df.columns.str.replace('_',' ')
df

                     email first name last name
0      huynh2102@gmail.com      Brian     Huynh
1  coreymschafer@gmail.com      Corey   Schafer
2        johndoe@gmail.com       John       Doe

In [38]:
#rechange information of 3rd row
df.loc[2,['last name', 'email']] = ['Wick', 'johnwick@email.com']
df

                     email first name last name
0      huynh2102@gmail.com      Brian     Huynh
1  coreymschafer@gmail.com      Corey   Schafer
2       johnwick@email.com       John      Wick

In [39]:
# Change only one field of data
df.loc[2, 'last name'] = 'Smith'
df

                     email first name last name
0      huynh2102@gmail.com      Brian     Huynh
1  coreymschafer@gmail.com      Corey   Schafer
2       johnwick@email.com       John     Smith

In [40]:
# Create a filter with a condition
filt = (df['email'] == 'huynh2102@gmail.com')
df[filt]

                 email first name last name
0  huynh2102@gmail.com      Brian     Huynh

In [41]:
# Now we can get single data from this filt
df[filt]['last name']

0    Huynh
Name: last name, dtype: object

In [42]:
# Change last name above

df.loc[filt, 'last name'] = 'Nguyen'
df

                     email first name last name
0      huynh2102@gmail.com      Brian    Nguyen
1  coreymschafer@gmail.com      Corey   Schafer
2       johnwick@email.com       John     Smith

In [43]:
df['last name'].str.lower()

0     nguyen
1    schafer
2      smith
Name: last name, dtype: object

In [44]:
# use 'apply function'
df['email'].apply(len)

0    19
1    23
2    18
Name: email, dtype: int64

In [45]:
# create a function 
def update_email(email):
    return email.upper()

In [46]:
df['email'].apply(update_email)
df

                     email first name last name
0      huynh2102@gmail.com      Brian    Nguyen
1  coreymschafer@gmail.com      Corey   Schafer
2       johnwick@email.com       John     Smith

In [47]:
# An other way to use apply method
df['email'] = df['email'].apply(update_email)
df

                     email first name last name
0      HUYNH2102@GMAIL.COM      Brian    Nguyen
1  COREYMSCHAFER@GMAIL.COM      Corey   Schafer
2       JOHNWICK@EMAIL.COM       John     Smith

In [48]:
# Get back data into lowercase by using lambda
df['email'] = df['email'].apply(lambda x: x.lower())
df

                     email first name last name
0      huynh2102@gmail.com      Brian    Nguyen
1  coreymschafer@gmail.com      Corey   Schafer
2       johnwick@email.com       John     Smith

In [49]:
# check the len of rows and columns, for the row is default
df.apply(len)

email         3
first name    3
last name     3
dtype: int64

In [50]:
# check the len of columns
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [51]:
df.applymap(str.lower)

                     email first name last name
0      huynh2102@gmail.com      brian    nguyen
1  coreymschafer@gmail.com      corey   schafer
2       johnwick@email.com       john     smith

In [52]:
df['first name'].map({'Corey': 'Doe', 'John': 'Marry'})
# When we do this method it would not change the data

0      NaN
1      Doe
2    Marry
Name: first name, dtype: object

In [53]:
# Use 'replace' method
df['first name'].replace({'Corey': 'Doe', 'John': 'Marry'})
# It would not be changed the data yet. So we need to appy it on an column so it would be change

0    Brian
1      Doe
2    Marry
Name: first name, dtype: object

In [54]:
df['first name'] = df['first name'].replace({'Corey': 'Doe', 'John': 'Marry'})
df

                     email first name last name
0      huynh2102@gmail.com      Brian    Nguyen
1  coreymschafer@gmail.com        Doe   Schafer
2       johnwick@email.com      Marry     Smith

In [55]:
# Combine two columns
df['full name'] = df['first name'] + ' '+ df['last name']
df

                     email first name last name     full name
0      huynh2102@gmail.com      Brian    Nguyen  Brian Nguyen
1  coreymschafer@gmail.com        Doe   Schafer   Doe Schafer
2       johnwick@email.com      Marry     Smith   Marry Smith

In [56]:
# Removing columns
df.drop(columns = ['first name', 'last name'], inplace=True)

In [57]:
df

                     email     full name
0      huynh2102@gmail.com  Brian Nguyen
1  coreymschafer@gmail.com   Doe Schafer
2       johnwick@email.com   Marry Smith

In [58]:
# split space of a columns
df[['first name', 'last name']] = df['full name'].str.split(' ', expand=True)

In [59]:
df

                     email     full name first name last name
0      huynh2102@gmail.com  Brian Nguyen      Brian    Nguyen
1  coreymschafer@gmail.com   Doe Schafer        Doe   Schafer
2       johnwick@email.com   Marry Smith      Marry     Smith

In [60]:
# Adding a single row in data
df.append({'first name': 'Tony'}, ignore_index=True)

                     email     full name first name last name
0      huynh2102@gmail.com  Brian Nguyen      Brian    Nguyen
1  coreymschafer@gmail.com   Doe Schafer        Doe   Schafer
2       johnwick@email.com   Marry Smith      Marry     Smith
3                      NaN           NaN       Tony       NaN

In [61]:
people1 = {
  "first name": ["Tony", "Steve"],
   "last name": ["Stark", "Rogers"],
    "email": ["ironman@email.com", "captainamerican@email.com"]
}
df2 = pd.DataFrame(people1)

In [62]:
df2

  first name last name                      email
0       Tony     Stark          ironman@email.com
1      Steve    Rogers  captainamerican@email.com

In [63]:
df.append(df2, ignore_index=True)

                       email     full name first name last name
0        huynh2102@gmail.com  Brian Nguyen      Brian    Nguyen
1    coreymschafer@gmail.com   Doe Schafer        Doe   Schafer
2         johnwick@email.com   Marry Smith      Marry     Smith
3          ironman@email.com           NaN       Tony     Stark
4  captainamerican@email.com           NaN      Steve    Rogers

In [64]:
df = df.append(df2, ignore_index=True)

In [65]:
df

                       email     full name first name last name
0        huynh2102@gmail.com  Brian Nguyen      Brian    Nguyen
1    coreymschafer@gmail.com   Doe Schafer        Doe   Schafer
2         johnwick@email.com   Marry Smith      Marry     Smith
3          ironman@email.com           NaN       Tony     Stark
4  captainamerican@email.com           NaN      Steve    Rogers

In [66]:
# Remove a row by indexing
df.drop(index=4, inplace=True)
# have use inplace method to change data

In [67]:
df

                     email     full name first name last name
0      huynh2102@gmail.com  Brian Nguyen      Brian    Nguyen
1  coreymschafer@gmail.com   Doe Schafer        Doe   Schafer
2       johnwick@email.com   Marry Smith      Marry     Smith
3        ironman@email.com           NaN       Tony     Stark

In [68]:
filt = df['last name'] == 'Stark'
df.drop(index = df[filt].index, inplace = True)
df

                     email     full name first name last name
0      huynh2102@gmail.com  Brian Nguyen      Brian    Nguyen
1  coreymschafer@gmail.com   Doe Schafer        Doe   Schafer
2       johnwick@email.com   Marry Smith      Marry     Smith

In [69]:
# Use sort value to sort a single field
df.sort_values(by='last name', ascending=False)

                     email     full name first name last name
2       johnwick@email.com   Marry Smith      Marry     Smith
1  coreymschafer@gmail.com   Doe Schafer        Doe   Schafer
0      huynh2102@gmail.com  Brian Nguyen      Brian    Nguyen

In [70]:
# Use sort value to sort a single field
df.sort_values(by=['last name', 'first name'], ascending=False)

                     email     full name first name last name
2       johnwick@email.com   Marry Smith      Marry     Smith
1  coreymschafer@gmail.com   Doe Schafer        Doe   Schafer
0      huynh2102@gmail.com  Brian Nguyen      Brian    Nguyen

In [71]:
# Add more data to dataframe
df=df.append({'first name': 'Stark', 'last name': 'Tony', 'full name': 'Tony Stark', 'email': 'tonystark@email.com'},ignore_index=True)

In [72]:
df

                     email     full name first name last name
0      huynh2102@gmail.com  Brian Nguyen      Brian    Nguyen
1  coreymschafer@gmail.com   Doe Schafer        Doe   Schafer
2       johnwick@email.com   Marry Smith      Marry     Smith
3      tonystark@email.com    Tony Stark      Stark      Tony

In [73]:
df.sort_values(by=['last name', 'first name'], ascending=[False, True], inplace=True)
df
# If we wanna save the data, so we need to add attribute <inplace=True>

                     email     full name first name last name
3      tonystark@email.com    Tony Stark      Stark      Tony
2       johnwick@email.com   Marry Smith      Marry     Smith
1  coreymschafer@gmail.com   Doe Schafer        Doe   Schafer
0      huynh2102@gmail.com  Brian Nguyen      Brian    Nguyen

In [74]:
# The abve data are mixed up the index column, now we arrange it again as ascending order
df.sort_index()

                     email     full name first name last name
0      huynh2102@gmail.com  Brian Nguyen      Brian    Nguyen
1  coreymschafer@gmail.com   Doe Schafer        Doe   Schafer
2       johnwick@email.com   Marry Smith      Marry     Smith
3      tonystark@email.com    Tony Stark      Stark      Tony

In [77]:
# Sort by series
df['last name'].sort_values()

0     Nguyen
1    Schafer
2      Smith
3       Tony
Name: last name, dtype: object